dotemacs.org
#+Options: toc:nil h:4
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle yes :results silent :exports code
#+TOC: headlines 4

* 目录
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#外部依赖][外部依赖]]
- [[#软件源][软件源]]
- [[#环境变量][环境变量]]
- [[#目录变量][目录变量]]
- [[#启动优化][启动优化]]
- [[#增量补全][增量补全]]
- [[#自动补全][自动补全]]
- [[#快速跳转][快速跳转]]
- [[#输入法][输入法]]
- [[#编辑辅助][编辑辅助]]
- [[#文档写作][文档写作]]
- [[#版本控制][版本控制]]
- [[#编程开发][编程开发]]
  - [[#lsp][lsp]]
  - [[#python][python]]
    - [[#pyenv][pyenv]]
    - [[#python-mode][python-mode]]
    - [[#lsp-pyright][lsp-pyright]]
  - [[#java][java]]
  - [[#go][go]]
  - [[#markdown][markdown]]
  - [[#dockerfile][dockerfile]]
  - [[#ansible][ansible]]
  - [[#web][web]]
    - [[#typescript][typescript]]
    - [[#javascript][javascript]]
    - [[#web-mode][web-mode]]
    - [[#emmet][emmet]]
    - [[#dap-mode][dap-mode]]
  - [[#yaml][yaml]]
  - [[#flycheck][flycheck]]
- [[#项目管理][项目管理]]
- [[#树形浏览][树形浏览]]
- [[#主题界面][主题界面]]
- [[#终端][终端]]
  - [[#vterm][vterm]]
  - [[#eshell][eshell]]
  - [[#tramp][tramp]]
- [[#其它][其它]]
:END:

* 外部依赖

本 emacs 配置依赖如下外部工具命令或软件包：
#+begin_src shell :results none
  mkdir -p ~/.emacs.d/backup 
  mkdir -p ~/.emacs.d/autosave
  mkdir -p ~/.emacs.d/.cache
  mkdir -p ~/.emacs.d/snippets
  mkdir -p ~/.emacs.d/.cache/lsp/npm/pyright/lib
  
  which fd || brew install fd
  which ag || brew install the_silver_searcher
  which rg || brew install ripgrep
  which fzf || brew install fzf
  
  brew tap laishulu/macism
  brew install macism
  
  pip install -q -i https://pypi.douban.com/simple/ ipython ansible
  
  go get golang.org/x/tools/gopls@latest
  
  # 关于 npm/node/yarn 等虚拟环境，参考：https://www.yuque.com/zhangjun-ibwli/iec7qs/ndvyyx#F61Lj
  brew install npm
  npm install -g vscode-json-languageserver
  npm install -g yaml-language-server
  npm install -g dockerfile-language-server-nodejs
  npm install -g eslint babel-eslint eslint-plugin-react
  npm install -g pyright
  pip install yapf
  
  brew install --HEAD pyenv
  brew install --HEAD pyenv-virtualenv
  
  brew install direnv
  
  trash -v || brew install trash
  pngpaste -v || brew install pngpaste
  which cmake || brew install cmake
  which glibtool || brew install libtool
  which exiftran || brew install exiftran
  
  which multimarkdown || brew install multimarkdown
  pip install grip
  
  which mutool || brew install mupdf # 将 pdf 转换为 png
  which pdftotext || brew install poppler
  brew install terminal-notifier # org notify
#+end_src
+ =dap-chrome= 依赖 =VSCode Chrome Debug Extension，可以通过 =M-x dap-chrome-setup= 安装。
+ 安装完 eslint npm 包后，需要在 emacs 中安装语言服务器 =M-x lsp-install-server
  RET eslint RET= 。

* 软件源

配置软件源仓库：
#+begin_src emacs-lisp
(require 'package)
(setq package-archives '(("gnu" . "https://mirrors.ustc.edu.cn/elpa/gnu/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("melpa-stable" . "https://mirrors.ustc.edu.cn/elpa/melpa-stable/")
                         ("org" . "https://mirrors.ustc.edu.cn/elpa/org/")))
(package-initialize)
(unless package-archive-contents (package-refresh-contents))
#+end_src

先安装 =use-package=, 后续使用它管理所有第三方软件包：
#+begin_src emacs-lisp
(setq use-package-always-ensure t)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
#+end_src

* 环境变量

GUI 或 systemd 启动的 Emacs 进程有可能没有继承用户 shell 环境变量，如 =PATH= ，导
致有些依赖的命令找不到。 =exec-path-from-shell= 包通过将指定的 shell 环境变量拷贝
到Emacs 环境中来解决这个问题：<<exec-path-from-shell>>

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :ensure
    :custom
    (exec-path-from-shell-check-startup-files nil)
    ;; 指定拷贝到 Emacs 的 shell 环境变量列表
    (exec-path-from-shell-variables '("PATH" "MANPATH" "GOPATH" "GOPROXY" "GOPRIVATE"))
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))
#+end_src

* 目录变量

目录变量是只对特定目录及子目录有效的变量。

安装 =direnv= 工具命令：
#+begin_src shell :results none
brew install direnv
#+end_src

[[https://direnv.net/docs/hook.html][将 direnv hook 到 shell 启动文件中]]：
#+begin_src shell :results none
eval "$(direnv hook bash)"
#+end_src

安装 emacs direnv 软件包，调用 direnv 命令获取当前文件或目录的环境变量，然后更新
到 emacs 变量 =process-environment= 和 =exec-path= ，emacs 后续启动的命令就会继承这
些环境变量：
#+begin_src emacs-lisp
;; 目录变量（.envrc)  
(use-package direnv :ensure :config (direnv-mode))  
#+end_src

使用步骤：
1. 在对应目录创建 =.envrc= 文件;
2. 向 .envrc 文件添加 shell 环境变量;
3. 执行 =direnv allow .= 生效环境变量;
   
#+begin_src shell :results none
$ echo export BAR=bar >>.envrc
direnv: error /Users/zhangjun/codes/github/operator/.envrc is blocked. Run `direnv allow` to approve its content

$ direnv allow .
direnv: loading ~/codes/github/operator/.envrc
direnv: export +BAR +FOO +GO111MODULE

$ cd ..
direnv: unloading
#+end_src
+ 如果某些变量未被 lsp 识别，则需要打开 .envrc 所在目录的文件后执行 =M-x
lsp-workspace-restart= 命令来重启语言服务器。

* 启动优化

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; emacs 28
  ;; (when (fboundp 'native-compile-async)
  ;;   (setenv "LIBRARY_PATH" 
  ;;           (concat (getenv "LIBRARY_PATH") 
  ;;                   "/usr/local/opt/gcc/lib/gcc/10:/usr/local/opt/gcc/lib/gcc/10/gcc/x86_64-apple-darwin20/10.2.0"))
  ;;   (setq comp-speed 3
  ;;         comp-async-jobs-number 4 
  ;;         comp-deferred-compilation nil
  ;;         comp-deferred-compilation-black-list '()
  ;;         ))
  ;; (setq package-native-compile t)
  
  (tool-bar-mode -1)
  (menu-bar-no-scroll-bar)
  (menu-bar-mode nil)
  (global-font-lock-mode t)
  (transient-mark-mode t)
  
  ;; Defer garbage collection further back in the startup process
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.5)
  
  (add-hook 'emacs-startup-hook
            (lambda ()
              "Recover GC values after startup."
              (setq gc-cons-threshold 800000
                    gc-cons-percentage 0.1)))
  
  ;; Increase how much is read from processes in a single chunk (default is 4kb)
  (setq read-process-output-max #x10000)  ; 64kb
  
  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)
  
  ;; 默认先最大化。
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  
  ;; Speed up startup
  (setq auto-mode-case-fold nil)  
  
  ;; 在Mac平台, Emacs不能进入Mac原生的全屏模式,否则会导致 `make-frame' 创建时也集
  ;; 成原生全屏属性后造成白屏和左右滑动现象. 所以先设置 `ns-use-native-fullscreen'
  ;; 和 `ns-use-fullscreen-animation' 禁止Emacs使用Mac原生的全屏模式. 而是采用传统
  ;; 的全屏模式, 传统的全屏模式, 只会在当前工作区全屏,而不是切换到Mac那种单独的全
  ;; 屏工作区,这样执行 `make-frame' 先关代码或插件时,就不会因为Mac单独工作区左右滑
  ;; 动产生的bug.
  ;;
  ;; Mac平台下,不能直接使用 `set-frame-parameter' 和 `fullboth' 来设置全屏,那样也
  ;; 会导致Mac窗口管理器直接把Emacs窗口扔到单独的工作区, 从而对 `make-frame' 产生
  ;; 同样的Bug. 所以, 启动的时候通过 `set-frame-parameter' 和 `maximized' 先设置
  ;; Emacs为最大化窗口状态, 启动5秒以后再设置成全屏状态, Mac就不会移动Emacs窗口到
  ;; 单独的工作区, 最终解决Mac平台下原生全屏窗口导致 `make-frame' 左右滑动闪烁的问
  ;; 题.
  (when (eq system-type 'darwin)
    (setq ns-use-native-fullscreen nil
          ns-use-fullscreen-animation nil))
  
  (add-hook 'after-init-hook #'toggle-frame-fullscreen)
  ;;(add-hook 'after-init-hook #'toggle-frame-maximized)
  
  (defconst sys/macp
    (eq system-type 'darwin)
    "Are we running on a Mac system?")
  
  (defconst sys/mac-x-p
    (and (display-graphic-p) sys/macp)
    "Are we running under X on a Mac system?")
  
  (defconst sys/mac-ns-p
    (eq window-system 'ns)
    "Are we running on a GNUstep or Macintosh Cocoa display?")
  
  (defconst sys/mac-cocoa-p
    (featurep 'cocoa)
    "Are we running with Cocoa on a Mac system?")
  
  (defconst sys/mac-port-p
    (eq window-system 'mac)
    "Are we running a macport build on a Mac system?")
#+end_src

