dotemacs.org
* 增量补全

#+begin_src emacs-lisp
  (use-package selectrum
    :ensure :demand
    :init
    (selectrum-mode +1))
  
  (use-package prescient
    :ensure :demand
    :config
    (prescient-persist-mode +1))
  
  (use-package selectrum-prescient
    :ensure :demand :after (selectrum)
    :init
    (selectrum-prescient-mode +1)
    (prescient-persist-mode +1))
  
  (use-package consult
    :ensure :demand :after (projectile)
    :bind
    (;; C-c bindings (mode-specific-map)
     ("C-c h" . consult-history)
     ("C-c m" . consult-mode-command)
     ("C-c b" . consult-bookmark)
     ("C-c k" . consult-kmacro)
     ;; C-x bindings (ctl-x-map)
     ("C-x M-:" . consult-complex-command)
     ("C-x b" . consult-buffer)
     ("C-x 4 b" . consult-buffer-other-window)
     ("C-x 5 b" . consult-buffer-other-frame)
     ;; Custom M-# bindings for fast register access
     ("M-#" . consult-register-load)
     ("M-'" . consult-register-store)
     ("C-M-#" . consult-register)
     ;; Other custom bindings
     ("M-y" . consult-yank-pop)
     ("<help> a" . consult-apropos)
     ;; M-g bindings (goto-map)
     ("M-g e" . consult-compile-error)
     ("M-g f" . consult-flycheck)
     ("M-g g" . consult-goto-line)
     ("M-g M-g" . consult-goto-line)
     ("M-g o" . consult-outline)
     ("M-g m" . consult-mark)
     ("M-g k" . consult-global-mark)
     ("M-g i" . consult-imenu)
     ("M-g I" . consult-project-imenu)
     ;; M-s bindings (search-map)
     ("M-s f" . consult-find)
     ("M-s L" . consult-locate)
     ("M-s F" . consult-locate)
     ("M-s g" . consult-grep)
     ("M-s G" . consult-git-grep)
     ("M-s r" . consult-ripgrep)
     ("M-s l" . consult-line)
     ("M-s L" . consult-line-multi)
     ("M-s m" . consult-multi-occur)
     ("M-s k" . consult-keep-lines)
     ("M-s u" . consult-focus-lines)
     ;; Isearch integration
     ("M-s e" . consult-isearch)
     :map isearch-mode-map
     ("M-e" . consult-isearch)
     ("M-s e" . consult-isearch)
     ("M-s l" . consult-line))
    :hook
    (completion-list-mode . consult-preview-at-point-mode)
    :init
    ;; 预览 register
    (setq register-preview-delay 0.1
          register-preview-function #'consult-register-format)
    (advice-add #'register-preview :override #'consult-register-window)
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
    :config
    ;; 下面的 preview-key 在 minibuff 中不生效，暂时关闭。
    ;; (consult-customize
    ;;  consult-ripgrep consult-git-grep consult-grep consult-bookmark consult-recent-file
    ;;  consult--source-file consult--source-project-file consult--source-bookmark
    ;;  :preview-key (kbd "M-."))
    ;; 选中候选者后，按 C-l 来预览，解决预览 TRAMP bookmark hang 的问题。
    (setq consult-preview-key (kbd "C-l"))
    (setq consult-narrow-key "<")
    (autoload 'projectile-project-root "projectile")
    (setq consult-project-root-function #'projectile-project-root))
  
  (use-package marginalia
    :ensure :demand :after (selectrum)
    :init (marginalia-mode)
    :config
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light))
    (advice-add #'marginalia-cycle
                :after (lambda () (when (bound-and-true-p selectrum-mode) (selectrum-exhibit 'keep-selected))))
    :bind
    (("M-A" . marginalia-cycle)
     :map minibuffer-local-map
     ("M-A" . marginalia-cycle)))
  
  (use-package embark
    :ensure :demand :after (selectrum which-key)
    :config
    (setq embark-prompter 'embark-keymap-prompter)
  
    (defun refresh-selectrum ()
      (setq selectrum--previous-input-string nil))
    (add-hook 'embark-pre-action-hook #'refresh-selectrum)
  
    (defun embark-act-noquit ()
      (interactive)
      (let ((embark-quit-after-action nil)) (embark-act)))
  
    (setq embark-action-indicator
          (lambda (map &optional _target)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator)
  
    :bind
    (("C-;" . embark-act-noquit)
     :map embark-variable-map ("l" . edit-list)))
  
  (use-package embark-consult
    :ensure :demand :after (embark consult)
    :hook
    (embark-collect-mode . embark-consult-preview-minor-mode))
#+end_src

* 自动补全

company 为 emacs 提供了自动补全框架, 它使用可插拔的前端和后端显示候选信息。

内置后端：Elisp, Clang, Semantic, Eclim, Ropemacs, Ispell, CMake, BBDB,
Yasnippet, dabbrev, etags, gtags, files, keywords 和 CAPF 等。

=CAPF= 是一个通用后端，它使用 Emacs 标准的 =completion-at-point-functions= 获取补全
信息，与使用该机制的 lsp-mode, emacs-lisp-mode, css-mode, nxml-mode 等 major
mode 能很好协作：

#+begin_src emacs-lisp
  (use-package company
    :ensure :demand
    :bind
    (:map company-mode-map
          ([remap completion-at-point] . company-complete)
          :map company-active-map
          ([escape] . company-abort)
          ("C-p"     . company-select-previous)
          ("C-n"     . company-select-next)
          ("C-s"     . company-filter-candidates)
          ([tab]     . company-complete-common-or-cycle)
          ([backtab] . company-select-previous-or-abort)
          :map company-search-map
          ([escape] . company-search-abort)
          ("C-p"    . company-select-previous)
          ("C-n"    . company-select-next))
    :custom
    ;; trigger completion immediately.
    (company-idle-delay 0)
    (company-echo-delay 0)
    ;; allow input string that do not match candidate words
    ;; 开启后有大量不匹配的候选情况，故关闭
    ;;(company-require-match nil)
    ;; number the candidates (use M-1, M-2 etc to select completions).
    (company-show-numbers t)
    ;; pop up a completion menu by tapping a character
    (company-minimum-prefix-length 1)
    (company-tooltip-limit 14)
    (company-tooltip-align-annotations t)
    ;; 大小写不敏感
    (company-dabbrev-ignore-case nil)
    ;; Don't downcase the returned candidates.
    (company-dabbrev-downcase nil)
    (company-tooltip-minimum-width 70)
    (company-tooltip-maximum-width 100)
    (company-backends '((company-capf :with company-yasnippet)
                        (company-dabbrev-code company-keywords company-files)
                        company-dabbrev))
    :config
    (global-company-mode t)

    ;; 修复与 lsp 不兼容的情况
    (defun my-lsp-fix-company-capf ()
      "Remove redundant `comapny-capf'."
      (setq company-backends
            (remove 'company-backends (remq 'company-capf company-backends))))
    (advice-add #'lsp-completion--enable :after #'my-lsp-fix-company-capf)

    ;; 不在前缀的候选列表里 snippets
    (defun my-company-yasnippet-disable-inline (fn cmd &optional arg &rest _ignore)
      "Enable yasnippet but disable it inline."
      (if (eq cmd  'prefix)
          (when-let ((prefix (funcall fn 'prefix)))
            (unless (memq (char-before (- (point) (length prefix)))
                          '(?. ?< ?> ?\( ?\) ?\[ ?{ ?} ?\" ?' ?`))
              prefix))
        (progn
          (when (and (bound-and-true-p lsp-mode)
                     arg (not (get-text-property 0 'yas-annotation-patch arg)))
            (let* ((name (get-text-property 0 'yas-annotation arg))
                   (snip (format "%s (Snippet)" name))
                   (len (length arg)))
              (put-text-property 0 len 'yas-annotation snip arg)
              (put-text-property 0 len 'yas-annotation-patch t arg)))
          (funcall fn cmd  arg))))
    (advice-add #'company-yasnippet :around #'my-company-yasnippet-disable-inline))
  #+end_src  
+ =dabbrev-expand= is essentially a form of completion where you first type a
  couple of letters of a word and press =M-/= . Emacs tries to complete the word
  by first looking at all the words in the current buffer, then in all other
  open buffers.

company-box 为候选者显示图标：
#+begin_src emacs-lisp
  (use-package company-box
    :ensure :demand :after (company all-the-icons)
    :init
    ;;(setq company-box-doc-enable nil)
    (setq company-box-doc-delay 0.1)
    :hook (company-mode . company-box-mode))
#+end_src

company-prescient 精准排序：
#+begin_src emacs-lisp
  (use-package company-prescient
    :ensure :demand :after prescient
    :init (company-prescient-mode +1))
#+end_src

company-quickhelp 显示候选者的帮助文档：
#+begin_src emacs-lisp
  ;; (use-package company-quickhelp ;
  ;;   :ensure :demand :disabled  :after (company)
  ;;   :init
  ;;   (setq company-quickhelp-delay 0.3)
  ;;   :config
  ;;   (company-quickhelp-mode 1))
#+end_src

