dotemacs.org
* 快速跳转

跳转到上次修改位置：
#+begin_src emacs-lisp
  (use-package goto-chg
    :ensure
    :config
    (global-set-key (kbd "C->") 'goto-last-change)
    (global-set-key (kbd "C-<") 'goto-last-change-reverse))
#+end_src

跳转到特定字符或行：
#+begin_src emacs-lisp
  (use-package avy
    :ensure
    :config
    (setq avy-all-windows nil
          avy-background t)
    :bind
    ("M-g c" . avy-goto-char-2)
    ("M-g l" . avy-goto-line))
#+end_src 

跳转到指定窗口：
#+begin_src emacs-lisp  
  (use-package ace-window
    :ensure
    :init
    ;; 使用字母而非数字标记窗口，便于跳转
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :config
    ;; 设置为 frame 后会忽略 treemacs frame，否则即使两个窗口时也会提示选择
    (setq aw-scope 'frame)
    ;; modeline 显示窗口编号
    ;;(ace-window-display-mode +1)
    (global-set-key (kbd "M-o") 'ace-window))
#+end_src

* 输入法

安装外置输入法切换工具 [[https://github.com/laishulu/macism#install][macism]]，解决 Mac 切换输入法后必须输入一个字符才能生效的问
题。同时系统的 “快捷键”->“选择上一个输入法” 快捷键必须要开启，否则 macism [[https://github.com/laishulu/macism/issues/2][会切换
失败]]。

#+begin_src emacs-lisp
  (use-package sis
    :ensure :demand
    :config
    (sis-ism-lazyman-config "com.apple.keylayout.ABC" "com.sogou.inputmethod.sogou.pinyin")
    ;; 自动切换到英文的前缀快捷键
    (push "C-;" sis-prefix-override-keys)
    (push "M-o" sis-prefix-override-keys)
    (push "M-g" sis-prefix-override-keys)
    (push "M-s" sis-prefix-override-keys)
    (sis-global-context-mode nil)
    (sis-global-respect-mode t)
    (global-set-key (kbd "C-\\") 'sis-switch)
    ;; (add-to-list sis-respect-minibuffer-triggers (cons 'org-roam-find-file (lambda () 'other)))
    ;; (add-to-list sis-respect-minibuffer-triggers (cons 'org-roam-insert (lambda () 'other)))
    ;; (add-to-list sis-respect-minibuffer-triggers (cons 'org-roam-capture (lambda () 'other)))
    ;; (add-to-list sis-respect-minibuffer-triggers (cons 'counsel-rg (lambda () 'other))
               ;; (setq sis-prefix-override-buffer-disable-predicates
               ;;       (list 'minibufferp
               ;;             (lambda (buffer)
               ;;               (sis--string-match-p "^magit-revision:" (buffer-name buffer)))
               ;;             (lambda (buffer)
               ;;               (and (sis--string-match-p "^\*" (buffer-name buffer))
               ;;                    (not (sis--string-match-p "^\*About GNU Emacs" (buffer-name buffer)))
               ;;                    (not (sis--string-match-p "^\*New" (buffer-name buffer)))
               ;;                    (not (sis--string-match-p "^\*Scratch" (buffer-name buffer)))
               ;;                    (not (sis--string-match-p "^\*doom:scra" (buffer-name buffer)))))))
  
  )
#+end_src
+ 必须在启用 =respect-mode= 之前设置 =sis-prefix-override-keys= 变量，否则变量不生效。

* 编辑辅助

#+begin_src emacs-lisp
  ;; 多光标编辑
  (use-package iedit :disabled :demand)
  
  ;; 直接在 minibuffer 中编辑 query
  (use-package isearch-mb
    :demand :after(consult)
    :config
    (add-to-list 'isearch-mb--with-buffer #'consult-isearch)
    (define-key isearch-mb-minibuffer-map (kbd "M-r") #'consult-isearch)
  
    (add-to-list 'isearch-mb--after-exit #'anzu-isearch-query-replace)
    (define-key isearch-mb-minibuffer-map (kbd "M-%") 'anzu-isearch-query-replace)
  
    (add-to-list 'isearch-mb--after-exit #'consult-line)
    (define-key isearch-mb-minibuffer-map (kbd "M-s l") 'consult-line))
  
  ;; 智能括号
  (use-package smartparens
    :config
    (smartparens-global-mode t)
    (show-smartparens-global-mode t))

  ;; 彩色括号
  (use-package rainbow-delimiters :hook (prog-mode . rainbow-delimiters-mode))

  ;; 智能扩展区域
  (use-package expand-region :bind ("M-@" . er/expand-region))
  
  ;; 显示缩进
  (use-package highlight-indent-guides
    :ensure :demand :after (python yaml-mode web-mode)
    :custom
    (highlight-indent-guides-method 'character)
    (highlight-indent-guides-responsive 'stack)
    (highlight-indent-guides-delay 0.1)
    :config
    (add-hook 'python-mode-hook 'highlight-indent-guides-mode)
    (add-hook 'yaml-mode-hook 'highlight-indent-guides-mode)
    (add-hook 'web-mode-hook 'highlight-indent-guides-mode))
  
  ;; 高亮变化的区域
  (use-package volatile-highlights
    :disabled
    :init (volatile-highlights-mode))
  
  ;; 在 modeline 显示匹配的总数和当前序号
  (use-package anzu
    :disabled
    :init
    (setq anzu-mode-lighter "")
    (global-set-key [remap query-replace] 'anzu-query-replace)
    (global-set-key [remap query-replace-regexp] 'anzu-query-replace-regexp)
    (define-key isearch-mode-map [remap isearch-query-replace] #'anzu-isearch-query-replace)
    (define-key isearch-mode-map [remap isearch-query-replace-regexp] #'anzu-isearch-query-replace-regexp)
    (global-anzu-mode))
  
  ;; 快速跳转当前 symbol
  (use-package symbol-overlay
    :config
    (global-set-key (kbd "M-i") 'symbol-overlay-put)
    (global-set-key (kbd "M-n") 'symbol-overlay-jump-next)
    (global-set-key (kbd "M-p") 'symbol-overlay-jump-prev)
    (global-set-key (kbd "<f7>") 'symbol-overlay-mode)
    (global-set-key (kbd "<f8>") 'symbol-overlay-remove-all)
    :hook (prog-mode . symbol-overlay-mode))
  
  ;; brew install ripgrep
  (use-package deadgrep :bind  ("<f5>" . deadgrep))
  
  (use-package xref
    :config
    ;; C-x p g (project-find-regexp)
    (setq xref-search-program 'ripgrep))
  
  ;;(shell-command "mkdir -p ~/.emacs.d/snippets")
  (use-package yasnippet
    :demand :after (lsp-mode company)
    :commands yas-minor-mode
    :config
    ;; 手动触发补全
    ;; (global-set-key (kbd "C-c y") 'company-yasnippet)
    (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")
    (yas-global-mode 1))
  
  ;; Youdao Dictionary
  (use-package youdao-dictionary
    :commands youdao-dictionary-play-voice-of-current-word
    :bind (("C-c y" . my-youdao-dictionary-search-at-point)
           ("C-c Y" . youdao-dictionary-search-at-point)
           :map youdao-dictionary-mode-map
           ("h" . youdao-dictionary-hydra/body)
           ("?" . youdao-dictionary-hydra/body))
    :init
    (setq url-automatic-caching t
          ;; 中文分词
          youdao-dictionary-use-chinese-word-segmentation t) 
  
    (defun my-youdao-dictionary-search-at-point ()
      "Search word at point and display result with `posframe', `pos-tip', or buffer."
      (interactive)
      (if (display-graphic-p)
          (youdao-dictionary-search-at-point-posframe)
        (youdao-dictionary-search-at-point)))
    :config
    (with-no-warnings
      (defun my-youdao-dictionary--posframe-tip (string)
        "Show STRING using posframe-show."
        (unless (and (require 'posframe nil t) (posframe-workable-p))
          (error "Posframe not workable"))
  
        (let ((word (youdao-dictionary--region-or-word)))
          (if word
              (progn
                (with-current-buffer (get-buffer-create youdao-dictionary-buffer-name)
                  (let ((inhibit-read-only t))
                    (erase-buffer)
                    (youdao-dictionary-mode)
                    (insert (propertize "\n" 'face '(:height 0.5)))
                    (insert string)
                    (insert (propertize "\n" 'face '(:height 0.5)))
                    (set (make-local-variable 'youdao-dictionary-current-buffer-word) word)))
                (posframe-show youdao-dictionary-buffer-name
                               :position (point)
                               :left-fringe 16
                               :right-fringe 16
                               :background-color (face-background 'tooltip nil t)
                               :internal-border-color (face-foreground 'font-lock-comment-face nil t)
                               :internal-border-width 1)
                (unwind-protect
                    (push (read-event) unread-command-events)
                  (progn
                    (posframe-hide youdao-dictionary-buffer-name)
                    (other-frame 0))))
            (message "Nothing to look up"))))
      (advice-add #'youdao-dictionary--posframe-tip
                  :override #'my-youdao-dictionary--posframe-tip)))
#+end_src

