dotemacs.org
* 版本控制

magit 是 emacs 最强大、最好用的版本控制系统操作界面，没有之一！
#+begin_src emacs-lisp
    (use-package magit
      :ensure
      :custom
      ;; 在当前 window 中显示 magit buffer
      (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
      ;;:config
      ;; 自动 revert buff，确保 modeline 上的分支名正确。
      ;; CPU profile 显示比较影响性能，暂不开启。
      ;;(setq auto-revert-check-vc-info nil)
  )
#+end_src

git-link 根据仓库地址、commit 等信息，为光标位置生成 URL:
#+begin_src emacs-lisp
(use-package git-link
  :ensure :defer
  :config
  (global-set-key (kbd "C-c g l") 'git-link)
  (setq git-link-use-commit t))
#+end_src

ediff:
#+begin_src emacs-lisp
  (setq
   ;; 忽略空格
   ediff-diff-options "-w" 
   ediff-split-window-function 'split-window-horizontally)
#+end_src

* 编程开发
** lsp

#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure :demand :after (flycheck)
    :hook
    (java-mode . lsp)
    (python-mode . lsp)
    (go-mode . lsp)
    ;;(yaml-mode . lsp)
    (web-mode . lsp)
    ;;(js-mode . lsp)
    (tide-mode . lsp)
    (typescript-mode . lsp)
    (dockerfile-mode . lsp)
    (lsp-mode . lsp-enable-which-key-integration)
    :custom
    ;; 调试时开启，极大影响性能
    (lsp-log-io nil)
    (lsp-enable-folding t)
    ;; lsp 显示的 links 不准确且导致 treemacs 目录显示异常，故关闭。
    ;; https://github.com/hlissner/doom-emacs/issues/2911
    ;; https://github.com/Alexander-Miller/treemacs/issues/626
    (lsp-enable-links nil)
    ;; 不在 modeline 上显示 code-actions 信息
    (lsp-modeline-code-actions-enable nil)
    (lsp-keymap-prefix "C-c l")
    (lsp-auto-guess-root t)
    (lsp-diagnostics-provider :flycheck)
    (lsp-diagnostics-flycheck-default-level 'warning)
    (lsp-completion-provider :capf)
    ;; Turn off for better performance
    (lsp-enable-symbol-highlighting nil)
    ;; 不显示面包屑
    (lsp-headerline-breadcrumb-enable nil)
    (lsp-enable-snippet t)
    ;; 不显示所有文档，否则 minibuffer 占用太多屏幕空间
    (lsp-eldoc-render-all nil)
    ;; lsp 使用 eldoc 在 minibuffer 显示函数签名， 设置显示的文档行数
    (lsp-signature-doc-lines 3)
    ;; 增加 IO 性能
    (process-adaptive-read-buffering nil)
    ;; 增大同 LSP 服务器交互时读取的文件大小
    (read-process-output-max (* 1024 1024))
    (lsp-idle-delay 0.1)
    (lsp-keep-workspace-alive t)
    (lsp-enable-file-watchers t)
    ;; Auto restart LSP.
    (lsp-restart 'auto-restart)
    :config
    (define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
    (dolist (dir '("[/\\\\][^/\\\\]*\\.\\(json\\|html\\|pyc\\|class\\|log\\|jade\\|md\\)\\'"
                   "[/\\\\]resources/META-INF\\'"
                   "[/\\\\]node_modules\\'"
                   "[/\\\\]vendor\\'"
                   "[/\\\\]\\.fslckout\\'"
                   "[/\\\\]\\.tox\\'"
                   "[/\\\\]\\.stack-work\\'"
                   "[/\\\\]\\.bloop\\'"
                   "[/\\\\]\\.metals\\'"
                   "[/\\\\]target\\'"
                   "[/\\\\]\\.settings\\'"
                   "[/\\\\]\\.project\\'"
                   "[/\\\\]\\.travis\\'"
                   "[/\\\\]bazel-*"
                   "[/\\\\]\\.cache"
                   "[/\\\\]_build"
                   "[/\\\\]\\.clwb$"))
      (push dir lsp-file-watch-ignored-directories))
    :bind
    (:map lsp-mode-map
          ("C-c f" . lsp-format-region)
          ("C-c d" . lsp-describe-thing-at-point)
          ("C-c a" . lsp-execute-code-action)
          ("C-c r" . lsp-rename)))
#+end_src

origami 提供代码折叠功能：
#+begin_src emacs-lisp
  (use-package origami
    :demand
    :config
    (define-prefix-command 'origami-mode-map)
    (global-set-key (kbd "C-x C-z") 'origami-mode-map)
    (global-origami-mode)
    :bind
    (:map origami-mode-map
          ("o" . origami-open-node)
          ("O" . origami-open-node-recursively)
          ("c" . origami-close-node)
          ("C" . origami-close-node-recursively)
          ("a" . origami-toggle-node)
          ("A" . origami-recursively-toggle-node)
          ("R" . origami-open-all-nodes)
          ("M" . origami-close-all-nodes)
          ("v" . origami-show-only-node)
          ("k" . origami-previous-fold)
          ("j" . origami-forward-fold)
          ("x" . origami-reset)))
#+end_src

consult-lsp 提供两个非常有用的命令：consult-lsp-symbols 和 consult-lsp-diagnostics：
  #+begin_src emacs-lisp
  (use-package consult-lsp
    :ensure :demand :after (lsp-mode consult)
    :config
    (define-key lsp-mode-map [remap xref-find-apropos] #'consult-lsp-symbols))
  #+end_src

lsp-ui 用于显示帮助信息：
#+begin_src emacs-lisp
  (use-package lsp-ui
    :ensure :after (lsp-mode flycheck)
    :custom
    ;; 关闭 cursor hover, 但 mouse hover 时显示文档
    (lsp-ui-doc-show-with-cursor nil)
    (lsp-ui-doc-delay 0.1)
    (lsp-ui-flycheck-enable t)
    (lsp-ui-sideline-enable nil)
    :config
    (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
    (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references))
#+end_src
+ lsp-mode 和 lsp-ui 的特性可以[[https://emacs-lsp.github.io/lsp-mode/tutorials/how-to-turn-off/][参考这个页面]]来进行选择性的打开和关闭；

** python
*** pyenv

pyenv 和 pyenv-virtualenv 提供了多个隔离的 python 版本环境，可以为项目或系统指定
不同的 python 版本或 venv。

#+begin_src shell :results none
brew install --HEAD pyenv
brew install --HEAD pyenv-virtualenv
#+end_src

为了在进入项目目录时自动切换到指定 pyenv 版本或 venv，需要配置 shell 初始化文件
（~/.bashrc）添加如下内容：
#+begin_src shell :results none
eval "$(pyenv init -)"
eval "$(pyenv virtualenv-init -)"
eval "$(jenv init -)"
#+end_src

pyenv 使用方法：
1. 列出可以安装的 python 版本： =pyenv install -l=
2. 安装指定的 python 版本： =pyenv install <version>=
3. 创建一个 pyenv virtualenv： =pyenv virtualenv [version] <virtualenv-name>= 
4. 为项目指定 python 版本或上一步创建的 virtualenv 名称：在项目根目录执行 =pyenv
   local <version1> <version2>= 命令，这会将版本信息写入项目根目录的
   =.python-version= 文件。

在做了上面的 shell集成后，cd 到该目录及子目录时，python 会自动切换到指定版本或激
活指定的 virtualenv；

pyenv-mode 通过给项目设置环境变量 ~PYENV_VERSION~ 来达到指定 pyenv 环境的目的：
#+begin_src emacs-lisp
  (use-package pyenv-mode
    :ensure :demand :disabled :after (projectile)
    :init
    (add-to-list 'exec-path "~/.pyenv/shims")
    (setenv "WORKON_HOME" "~/.pyenv/versions/")
    :config
    (pyenv-mode)
    (defun projectile-pyenv-mode-set ()
      (let ((project (projectile-project-name)))
        (if (member project (pyenv-mode-versions))
            (pyenv-mode-set project)
          (pyenv-mode-unset))))
    (add-hook 'projectile-after-switch-project-hook 'projectile-pyenv-mode-set)
    :bind
    ;; 防止和 org-mode 快捷键冲突
    (:map pyenv-mode-map ("C-c C-u") . nil)
    (:map pyenv-mode-map ("C-c C-s") . nil))  
#+end_src

*** python-mode

#+begin_src emacs-lisp
  (defun my/python-setup-shell (&rest args)
    "Set up python shell"
    (if (executable-find "ipython")
        (progn
          (setq python-shell-interpreter "ipython")
          ;; ipython version >= 5
          (setq python-shell-interpreter-args "--simple-prompt -i"))
      (progn
        (setq python-shell-interpreter "python")
        (setq python-shell-interpreter-args "-i"))))
  
  (defun my/python-setup-checkers (&rest args)
    (when (fboundp 'flycheck-set-checker-executable)
      (let ((pylint (executable-find "pylint"))
            (flake8 (executable-find "flake8")))
        (when pylint
          (flycheck-set-checker-executable "python-pylint" pylint))
        (when flake8
          (flycheck-set-checker-executable "python-flake8" flake8)))))
  
  (use-package python
    :ensure :demand :after(flycheck)
    :hook
    (python-mode . (lambda ()
                     (my/python-setup-shell)
                     (my/python-setup-checkers)
                     (setq indent-tabs-mode nil)
                     (setq tab-width 4)
                     (setq python-indent-offset 4))))
#+end_src

