dotemacs.org
*** lsp-pyright

微软不再维护 python-language-server，转向 pyright 和 pyglance，所以不再使用
lsp-python-ms 和 pyls，转向使用 lsp-pyright。

#+begin_src emacs-lisp
  ;;(shell-command "mkdir -p ~/.emacs.d/.cache/lsp/npm/pyright/lib")
  (use-package lsp-pyright
    :ensure :demand :after (python)
    :preface
         ;; Use yapf to format
         (defun lsp-pyright-format-buffer ()
           (interactive)
           (when (and (executable-find "yapf") buffer-file-name)
             (call-process "yapf" nil nil nil "-i" buffer-file-name)))
    :hook
    (python-mode . (lambda ()
                     (require 'lsp-pyright)
                     (add-hook 'after-save-hook #'lsp-pyright-format-buffer t t)))
    :init (when (executable-find "python3")
            (setq lsp-pyright-python-executable-cmd "python3")))
#+end_src
+ 更新 pyright 到最新版本: =sudo npm update -g pyright=
+ 使用 yapf 来格式化 python 代码: =pip install yapf=

pyright _不使用_ pyenv 的 ~.python-version~ 指定的 python 版本或 venv，而是需要在项
目的 pyrightconfig.json 文件中配置 venv 和 venvPath 参数来指定 python 环境：
+ venvPath：指定查找 venv 目录的上级目录，可以包含多个 venv 环境；
+ venv：指定 venvPath 目录下的、使用的虚拟环境名称；
+ pyright 在 venv 中搜索 pip 安装的 site-packages;

可以安装 =pyenv-pyright= 插件来方便的创建和更新 pyrightconfig.json 文件中的 venv
和 venvPath 配置：
#+begin_src shell :results none
# 安装 pyright 插件
git clone https://github.com/alefpereira/pyenv-pyright.git $(pyenv root)/plugins/pyenv-pyright
#+end_src

使用方法：
1. 先使用 =pyenv local= 为项目指定 pyenv virtualenv;
2. 使用 =pyenv pyright= 命令配置 pyrightconfig.json 使用上一步指定的 pyenv virtualenv；
  
pyright 假设源代码 py 源文件是位于项目 scr 目录下，但实际可能会在多个其它子目录
（还有嵌套情况）中放置项目源码，也就是所谓的 multi-root 模式（对应于vscode 中的
多 worksapce 目录)，这时可能出现大量 import 错误，可以通过在项目 root目录配置
=pyrightconfig.json= 文件来解决，示例如下（python module 查找过程 [[https://github.com/microsoft/pyright/blob/main/docs/import-resolution.md][Import
Resolution]]）：
#+begin_src json :results none
{
    "venv": "venv-2.7.18",
    "venvPath": "/Users/zhangjun/.pyenv/versions",
    "verboseOutput": true,
    "reportMissingTypeStubs": false,
    "executionEnvironments": [
        {
            "root": "scripts",
            "extraPaths": [
                ".",  // scripts 目录下 py 文件导入同级 py 文件的情况
                "scripts/appinstance_apply" 
            ]
        }
    ]
}
#+end_src

executionEnvironments：
1. 列表中 root 指定各 workspace 的子目录，是有搜索优先级的，所以如果有相同路径前
   缀的情况，应该从长到短依列出来： 根据 python 文件的 from/import 语句来确定
   root 路径：即从项目根目录（pyrightconfig.json 文件所在目录）开始到文件中导入
   路径最开始所在目录 之间的目录，都应该是 root。
2. extraPaths 列表中的路径可以是绝对路径或相对路径（相对于 pyrightconfig.json 文
   件），用于添加额外的 python module 搜索路径；
   + 添加 "." 是因为需要将 scripts 所在的目录也添加到 module 搜索路径，而不仅仅
     是 scripts 下的子目录；
3. 官方的实例参考：[[https://github.com/microsoft/pyright/blob/main/docs/configuration.md#sample-config-file][Sample Config File]] 和 [[https://github.com/microsoft/pyright/blob/main/packages/pyright-internal/src/tests/testState.test.ts][testState.test.ts]]；

[[https://github.com/Microsoft/pyright/issues/21][pyright 不支持 python 2.x]]，如果在上面文件配置 ="pythonVersion": "2.7"= 则会报错。

修改了 pyrightconfig.json 文件后，需要执行 ~M-x lsp-workspace-restart~ 来重启 lsp，
如果还是有问题，则可以查看 =*lsp-log*= buffer 中的日志。

** java

默认将 lsp java server 安装到 ~/.emacs.d/.cache/lsp/eclipse.jdt.ls 目录。

手动安装 lombok: 
#+begin_src shell :results none
mvn dependency:get -DrepoUrl=http://download.java.net/maven/2/ -DgroupId=org.projectlombok -DartifactId=lombok -Dversion=1.18.6
#+end_src

#+begin_src emacs-lisp
(use-package lsp-java
  :ensure :demand :disabled t :after (lsp-mode company)
  :init
  ;; 指定运行 jdtls 的 java 程序
  (setq lsp-java-java-path "/Library/Java/JavaVirtualMachines/jdk-11.0.9.jdk/Contents/Home")
  ;; 指定 jdtls 编译源码使用的 jdk 版本（默认是启动 jdtls 的 java 版本）。
  ;; https://marketplace.visualstudio.com/items?itemName=redhat.java
  ;; 查看所有 java 版本：/usr/libexec/java_home -verbose
  (setq lsp-java-configuration-runtimes
        '[(:name "Java SE 8" :path "/Library/Java/JavaVirtualMachines/jdk1.8.0_271.jdk/Contents/Home" :default t)
          (:name "Java SE 11.0.9" :path "/Library/Java/JavaVirtualMachines/jdk-11.0.9.jdk/Contents/Home")
          (:name "Java SE 15.0.1" :path "/Library/Java/JavaVirtualMachines/jdk-15.0.1.jdk/Contents/Home")])
  ;; jdk11 不支持 -Xbootclasspath/a: 参数。
  (setq lsp-java-vmargs
        (list "-noverify" "-Xmx2G" "-XX:+UseG1GC" "-XX:+UseStringDeduplication"
              (concat "-javaagent:" (expand-file-name "~/.m2/repository/org/projectlombok/lombok/1.18.6/lombok-1.18.6.jar"))))
  :hook (java-mode . lsp)
  :config
  (use-package dap-mode :ensure :disabled t :after (lsp-java) :config (dap-auto-configure-mode))
  (use-package dap-java :ensure :disabled t))
#+end_src

** go

安装最新的 gopls:
#+begin_src shell :results none
go get golang.org/x/tools/gopls@latest
#+end_src

#+begin_src emacs-lisp
  (use-package go-mode
    :ensure :demand :after (lsp-mode)
    :init
    (defun lsp-go-install-save-hooks ()
      (add-hook 'before-save-hook #'lsp-format-buffer t t)
      (add-hook 'before-save-hook #'lsp-organize-imports t t))
    :custom
    (lsp-gopls-staticcheck t)
    (lsp-gopls-complete-unimported t)
    :hook
    (go-mode . lsp-go-install-save-hooks)
    :config
    (lsp-register-custom-settings
     `(("gopls.completeUnimported" t t)
       ("gopls.experimentalWorkspaceModule" t t)
       ("gopls.allExperiments" t t))))
#+end_src
+ gopls 的有些变量可以通过 setq 来设置，如 (setq lsp-gopls-use-placeholders
  nil), 详细参考 [[https://github.com/emacs-lsp/lsp-mode/blob/master/clients/lsp-go.el][lsp-go]] . 有些环境变量需要通过 =lsp-register-custom-settings= 来设
  置;
+ 需要开启 =gopls.experimentalWorkspaceModule= 来支持嵌入式 module, 否则在打开相应
  module 时提示：
#+begin_quote
emacs errors loading workspace: You are working in a nested module. Please open it as a separate workspace folder. Learn more:
#+end_quote

** markdown

multimarkdown 实现将 markdown 转换为 html 进行 preview，可以结合 xwidget webkit
或 grip 实时预览：

#+begin_src shell :results none
brew install multimarkdown
pip install grip
#+end_src

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure
    :commands (markdown-mode gfm-mode)
    :mode
    (("README\\.md\\'" . gfm-mode)
     ("\\.md\\'" . markdown-mode)
     ("\\.markdown\\'" . markdown-mode))
    :init
    (when (executable-find "multimarkdown")
      (setq markdown-command "multimarkdown"))
    (setq markdown-enable-wiki-links t
          markdown-italic-underscore t
          markdown-asymmetric-header t
          markdown-make-gfm-checkboxes-buttons t
          markdown-gfm-uppercase-checkbox t
          markdown-fontify-code-blocks-natively t
          markdown-content-type "application/xhtml+xml"
          markdown-css-paths '("https://cdn.jsdelivr.net/npm/github-markdown-css/github-markdown.min.css"
                               "https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/github.min.css")
          markdown-xhtml-header-content "
  <meta name='viewport' content='width=device-width, initial-scale=1, shrink-to-fit=no'>
  <style>
  body {
    box-sizing: border-box;
    max-width: 740px;
    width: 100%;
    margin: 40px auto;
    padding: 0 10px;
  }
  </style>
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/styles/default.min.css'>
  <script src='https://cdn.jsdelivr.net/gh/highlightjs/cdn-release/build/highlight.min.js'></script>
  <script>
  document.addEventListener('DOMContentLoaded', () => {
    document.body.classList.add('markdown-body');
    document.querySelectorAll('pre code').forEach((code) => {
      if (code.className != 'mermaid') {
        hljs.highlightBlock(code);
      }
    });
  });
  </script>
  <script src='https://unpkg.com/mermaid@8.4.8/dist/mermaid.min.js'></script>
  <script>
  mermaid.initialize({
    theme: 'default',  // default, forest, dark, neutral
    startOnLoad: true
  });
  </script>
  "
          markdown-gfm-additional-languages "Mermaid"))
#+end_src

使用 grip 来预览 markdown 文件，它调用 github markdown API 来渲染文件，从而确保
渲染后分隔和 Github 一致。为了避免 API 调用频率限制，可以创建一个空 scop 的
Access Token，然后将 username 和 token 保存到 =~/.authinfo= 文件中：

#+begin_src bash :results none
$ grep api.github  ~/.authinfo 
machine api.github.com login geekard@qq.com password YOUR_TOKEN
#+end_src

在 Markdown Buffer 中，执行 =M-x grip-mode= 来启用实时预览，然后可以执行如下命令：
+ M-x grip-start-preview
+ M-x grip-stop-preview
+ M-x grip-restart-preview
+ M-x grip-browse-preview 使用浏览器来预览
#+begin_src emacs-lisp  
  (use-package grip-mode
    :bind (:map markdown-mode-command-map
                ("g" . grip-mode))
    :config
    (setq grip-preview-use-webkit nil)
    ;; 支持网络访问（默认 localhost）
    (setq grip-preview-host "0.0.0.0")
    ;; 保存文件时才更新预览
    (setq grip-update-after-change nil)
    ;; 从 ~/.authinfo 文件获取认证信息
    (require 'auth-source)
    (let ((credential (auth-source-user-and-password "api.github.com")))
               (setq grip-github-user (car credential)
                     grip-github-password (cadr credential))))
#+end_src
+ 安装 grip： =pip install grip=

#+begin_src emacs-lisp
  (use-package markdown-toc
    :ensure :demand :after(markdown-mode)
    :bind (:map markdown-mode-command-map
           ("r" . markdown-toc-generate-or-refresh-toc)))
#+end_src

** dockerfile

#+begin_src shell :results none
which dockerfile-language-server-nodejs &>/dev/null || npm install -g dockerfile-language-server-nodejs &>/dev/null
#+end_src

#+begin_src emacs-lisp
  (use-package dockerfile-mode
    :ensure
    :config (add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)))
#+end_src

** ansible
#+begin_src emacs-lisp  
  (use-package ansible
    :ensure :after (yaml-mode)
    :config
    (add-hook 'yaml-mode-hook '(lambda () (ansible 1))))
  
  (use-package company-ansible
    :ensure :after (ansible company)
    :config
    (add-hook 'ansible-hook
              (lambda()
                (add-to-list 'company-backends 'company-ansible))))
  
  ;; ansible-doc 使用系统的 ansible-doc 命令搜索文档
  ;; (shell-command "pip install ansible")
  (use-package ansible-doc
    :ensure :after (ansible yasnippet)
    :config
    (add-hook 'ansible-hook
              (lambda()
                (ansible-doc-mode) (yas-minor-mode-on)))
    (define-key ansible-doc-mode-map (kbd "M-?") #'ansible-doc))
#+end_src

** web
