dotemacs.org
*** typescript

#+begin_src emacs-lisp  
  (defun my/use-eslint-from-node-modules ()
  ;; use local eslint from node_modules before global
  ;; http://emacs.stackexchange.com/questions/21205/flycheck-with-file-relative-eslint-executable
    (let* ((root (locate-dominating-file (or (buffer-file-name) default-directory) "node_modules"))
           (eslint (and root (expand-file-name "node_modules/eslint/bin/eslint.js" root))))
      (when (and eslint (file-executable-p eslint))
        (setq-local flycheck-javascript-eslint-executable eslint))))
  
  ;; (shell-command "which npm &>/dev/null || brew install npm &>/dev/null")
  (defun my/setup-tide-mode ()
    "Use hl-identifier-mode only on js or ts buffers."
    (when (and (stringp buffer-file-name)
               (string-match "\\.[tj]sx?\\'" buffer-file-name))
      (tide-setup)
      (add-hook 'flycheck-mode-hook #'my/use-eslint-from-node-modules)
      (tide-hl-identifier-mode +1)))
  
  ;; for .ts and .tsx file
  (use-package typescript-mode
    :ensure :demand :after (flycheck)
    :init
    (add-to-list 'auto-mode-alist '("\\.tsx?\\'" . typescript-mode))
    :hook
    ((typescript-mode . my/setup-tide-mode))
    :config
    (flycheck-add-mode 'typescript-tslint 'typescript-mode)
    (setq typescript-indent-level 2))
#+end_src

tide 是 typescript/javascript 交互式开发环境，支持 js-mode（Emacs 27 内置）、
js2-mode、web-mode（编辑模板文件，如 HTML、Go Template等）、typescript-mode。

通过调用 ts-ls(npm install -g typescript-language-server)语言服务器，结合company
和 lsp 为 js/ts 提供代码补全和导航。

jsts-ls(javascript-typescript-stdio) 不再维护了：
https://github.com/sourcegraph/javascript-typescript-langserver

#+begin_src  emacs-lisp
  (use-package tide
    :ensure :demand :after (typescript-mode company flycheck)
    :hook ((before-save . tide-format-before-save)))
  ;; 开启 tsserver 的 debug 日志模式
  (setq tide-tsserver-process-environment '("TSS_LOG=-level verbose -file /tmp/tss.log"))
#+end_src

*** javascript

js-mode (Emacs 27 内置) 和 js2-mode （js-mode 的增强，主要是 jsx 相关）用于编辑.js
和 .jsx 文件。

js-mode in Emacs 27 includes full support for syntax highlighting and indenting
of JSX syntax. The currently recommended solution is to install Emacs 27 and use
js-mode as the major mode. To make use of the JS2 AST and the packages that
integrate with it, we recommend js2-minor-mode.
https://github.com/mooz/js2-mode#react-and-jsx

#+begin_src emacs-lisp
  (use-package js2-mode
    :ensure :demand :after (tide)
    :config
    ;; js-mode-map 将 M-. 绑定到 js-find-symbol, 没有使用 tide 和 lsp, 所以需要解
    ;; 绑。这样 M-. 被 tide 绑定到 tide-jump-to-definition.
    (define-key js-mode-map (kbd "M-.") nil)
    ;; 如上所述, 使用 Emacs 27 自带的 js-mode major mode 来编辑 js 文件。
    ;;(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
    (add-hook 'js-mode-hook 'js2-minor-mode)
    ;; 为 js/jsx 文件启动 tide.
    (add-hook 'js-mode-hook 'my/setup-tide-mode)
    ;; disable jshint since we prefer eslint checking
    (setq-default flycheck-disabled-checkers (append flycheck-disabled-checkers '(javascript-jshint)))
    (flycheck-add-mode 'javascript-eslint 'js-mode)
    (flycheck-add-next-checker 'javascript-eslint 'javascript-tide 'append)
    (flycheck-add-next-checker 'javascript-eslint 'jsx-tide 'append)
    (add-to-list 'interpreter-mode-alist '("node" . js2-mode)))
#+end_src

*** web-mode

web-mode 用于编辑 html/css/jinja2/gotmpl/tmpl 等模板文件，不用于编辑
js/jsx/ts/tsx 等类型文件。

#+begin_src  emacs-lisp
  (use-package web-mode
    :ensure :demand :after (tide)
    :custom
    (web-mode-enable-auto-pairing t)
    (web-mode-enable-css-colorization t)
    :config
    (setq web-mode-markup-indent-offset 4
          web-mode-css-indent-offset 4
          web-mode-code-indent-offset 4
          web-mode-enable-auto-quoting nil
          web-mode-enable-block-face t
          web-mode-enable-current-element-highlight t)
    (flycheck-add-mode 'javascript-eslint 'web-mode)
    (add-to-list 'auto-mode-alist '("\\.jinja2?\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tmpl\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.json\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.gotmpl\\'" . web-mode)))
#+end_src

*** emmet

#+begin_src emacs-lisp
  (use-package emmet-mode 
    :ensure :demand :after(web-mode js2-mode)
    :config
    (add-hook 'sgml-mode-hook 'emmet-mode)
    (add-hook 'css-mode-hook  'emmet-mode)
    (add-hook 'web-mode-hook  'emmet-mode)
    (add-hook 'emmet-mode-hook (lambda () (setq emmet-indent-after-insert nil)))
    (add-hook 'emmet-mode-hook (lambda () (setq emmet-indentation 2)))
    (setq emmet-expand-jsx-className? t)
    ;; Make `emmet-expand-yas' not conflict with yas/mode
    (setq emmet-preview-default nil))
#+end_src

*** dap-mode  

#+begin_src  emacs-lisp
  (use-package dap-mode
    :ensure :demand :disabled
    :config
    (dap-auto-configure-mode 1)
    (require 'dap-chrome))
#+end_src
+  执行 M-x dap-chrome-setup 安装 VSCode Chrome Debug Extension.
** yaml

#+begin_src shell :results none
which yaml-language-server &>/dev/null || npm install -g yaml-language-server &>/dev/null
#+end_src

#+begin_src  emacs-lisp
  (use-package yaml-mode
    :ensure
    :hook
    (yaml-mode . (lambda () (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
    :config
    (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
    (add-to-list 'auto-mode-alist '("\\.yaml\\'" . yaml-mode)))
#+end_src

** flycheck

flycheck 是现代的在线语法检查工具, 用于取代 emacs 内置的 flymake 工具。它使用系
统安装的工具对 buffer 进行检查。（如果使用 GUI Emacs, 需要安装
[[exec-path-from-shell][exec-path-from-shell]] 软件包。）

#+begin_src emacs-lisp
  (use-package flycheck
    :ensure
    :config
    ;; 高亮出现错误的列位置
    (setq flycheck-highlighting-mode (quote columns))
    (setq flycheck-check-syntax-automatically '(save idle-change mode-enabled))
    (define-key flycheck-mode-map (kbd "M-g n") #'flycheck-next-error)
    (define-key flycheck-mode-map (kbd "M-g p") #'flycheck-previous-error)
    ;; 在当前窗口底部显示错误列表
    (add-to-list 'display-buffer-alist
                 `(,(rx bos "*Flycheck errors*" eos)
                   (display-buffer-reuse-window
                    display-buffer-in-side-window)
                   (side            . bottom)
                   (reusable-frames . visible)
                   (window-height   . 0.33)))
  
    :hook
    (prog-mode . flycheck-mode))
  
  (use-package consult-flycheck
    :ensure :demand :after (consult flycheck)
    :bind
    (:map flycheck-command-map ("!" . consult-flycheck)))
#+end_src

flycheck-pos-tip 提供在线显示 flycheck 错误的功能：
#+begin_src emacs-lisp
  (use-package flycheck-pos-tip
    :ensure :after (flycheck)
    :config
    (flycheck-pos-tip-mode))
#+end_src

