dotemacs.org
* 项目管理
#+begin_src emacs-lisp
  (use-package projectile
    :ensure :demand :after (treemacs)
    :config
    (projectile-global-mode)
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
    (projectile-mode +1)
    ;; selectrum 使用 'default，可选：'ivy、'helm、'ido、'auto
    (setq projectile-completion-system 'default)
    ;; 开启 cache 后，提高性能，也可以解决 TRAMP 的问题，https://github.com/bbatsov/projectile/pull/1129
    (setq projectile-enable-caching t)
    (setq projectile-sort-order 'recently-active)
    (add-hook 'projectile-after-switch-project-hook
              (lambda () (unless (bound-and-true-p treemacs-mode) (treemacs) (other-window 1))))
    (add-to-list 'projectile-ignored-projects (concat (getenv "HOME") "/" "/root" "/tmp" "/etc" "/home"))
    (dolist (dirs '(".cache"
                    ".dropbox"
                    ".git"
                    ".hg"
                    ".svn"
                    ".nx"
                    "elpa"
                    "auto"
                    "bak"
                    "__pycache__"
                    "vendor"
                    "node_modules"
                    "logs"
                    "target"
                    ".idea"
                    "build"
                    ".devcontainer"
                    ".settings"
                    ".gradle"
                    ".vscode"))
      (add-to-list 'projectile-globally-ignored-directories dirs))
    (dolist (item '("GPATH"
                    "GRTAGS"
                    "GTAGS"
                    "GSYMS"
                    "TAGS"
                    ".tags"
                    ".classpath"
                    ".project"
                    ".DS_Store"
                    "__init__.py"))
      (add-to-list 'projectile-globally-ignored-files item))
    (dolist (list '("\\.elc\\'"
                    "\\.o\\'"
                    "\\.class\\'"
                    "\\.out\\'"
                    "\\.pdf\\'"
                    "\\.pyc\\'"
                    "\\.rel\\'"
                    "\\.rip\\'"
                    "\\.swp\\'"
                    "\\.iml\\'"
                    "\\.bak\\'"
                    "\\.log\\'"
                    "~\\'"))
      (add-to-list 'projectile-globally-ignored-file-suffixes list)))
  
  ;; C-c p s r (projectile-ripgrep)
  (use-package ripgrep :ensure :demand :after (projectile))
#+end_src

* 树形浏览

#+begin_src emacs-lisp
;;(shell-command "mkdir -p ~/.emacs.d/.cache")
(use-package treemacs
  :ensure :demand
  :init
  (with-eval-after-load 'winum (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq
     treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
     treemacs-deferred-git-apply-delay      0.1
     treemacs-display-in-side-window        t
     treemacs-eldoc-display                 t
     treemacs-file-event-delay              100
     treemacs-file-follow-delay             0.1
     treemacs-follow-after-init             t
     treemacs-git-command-pipe              ""
     treemacs-goto-tag-strategy             'refetch-index
     treemacs-indentation                   1
     treemacs-indentation-string            " "
     treemacs-is-never-other-window         nil
     treemacs-max-git-entries               3000
     treemacs-missing-project-action        'remove
     treemacs-no-png-images                 nil
     treemacs-no-delete-other-windows       t
     treemacs-project-follow-cleanup        t
     treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
     treemacs-position                      'left
     treemacs-recenter-distance             0.1
     treemacs-recenter-after-file-follow    t
     treemacs-recenter-after-tag-follow     t
     treemacs-recenter-after-project-jump   'always
     treemacs-recenter-after-project-expand 'on-distance
     treemacs-shownn-cursor                 t
     treemacs-show-hidden-files             t
     treemacs-silent-filewatch              nil
     treemacs-silent-refresh                nil
     treemacs-sorting                       'alphabetic-asc
     treemacs-space-between-root-nodes      nil
     treemacs-tag-follow-cleanup            t
     treemacs-tag-follow-delay              1
     treemacs-width                         35
     imenu-auto-rescan                      t)
    (treemacs-resize-icons 11)
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode t)
    (pcase (cons (not (null (executable-find "git"))) (not (null treemacs-python-executable)))
      (`(t . t) (treemacs-git-mode 'deferred))
      (`(t . _) (treemacs-git-mode 'simple))))
  :bind
  (:map
   global-map
   ("M-0"       . treemacs-select-window)
   ("C-x t 1"   . treemacs-delete-other-windows)
   ("C-x t t"   . treemacs)
   ("C-x t B"   . treemacs-bookmark)
   ("C-x t C-t" . treemacs-find-file)
   ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-projectile :after (treemacs projectile) :ensure  :demand)
(use-package treemacs-magit :after (treemacs magit) :ensure :demand)
(use-package persp-mode
  :ensure :demand :disabled
  :custom
  (persp-keymap-prefix (kbd "C-x p"))
  :config
  (persp-mode))

(use-package treemacs-persp 
  :ensure :demand :disabled
  :after (treemacs persp-mode)
  :config
  (treemacs-set-scope-type 'Perspectives))

;;lsp-treemacs 在 treemacs 显示文件的 symbol、errors 和 hierarchy：
(use-package lsp-treemacs
  :ensure :disabled :after (lsp-mode treemacs)
  :config
  (lsp-treemacs-sync-mode 1))
#+end_src

