dotemacs.org
* 主题界面

#+begin_src emacs-lisp
  ;; Make certain buffers grossly incandescent
  (display-battery-mode t)
  (column-number-mode t)
  (size-indication-mode -1)
  (display-time-mode t)
  (setq display-time-24hr-format t
        display-time-default-load-average nil
        display-time-load-average-threshold 5
        display-time-format "%m/%d[%u]%H:%M"
        display-time-day-and-date t)
  (setq indicate-buffer-boundaries (quote left))
  
  (show-paren-mode t)
  (setq show-paren-style 'parentheses)
  
  ;; Line numbers are not displayed when large files are used.
  (setq line-number-display-limit large-file-warning-threshold)
  (setq line-number-display-limit-width 1000)
  (dolist (mode '(text-mode-hook prog-mode-hook conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
  (setq-default indicate-empty-lines t)
  (when (not indicate-empty-lines) (toggle-indicate-empty-lines))
  
  (setq inhibit-startup-screen t
        inhibit-startup-message t
        inhibit-startup-echo-area-message t
        initial-scratch-message nil)
  
  ;; 按照中文折行
  (setq word-wrap-by-category t)
  
  ;; Optimization
  (setq idle-update-delay 1.0)
  
  (when (and sys/mac-ns-p sys/mac-x-p)
    (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
    (add-to-list 'default-frame-alist '(ns-appearance . dark))
    (add-hook 'after-load-theme-hook
              (lambda ()
                (let ((bg (frame-parameter nil 'background-mode)))
                  (set-frame-parameter nil 'ns-appearance bg)
                  (setcdr (assq 'ns-appearance default-frame-alist) bg)))))
  
  ;; Inhibit resizing frame
  ;;(setq frame-inhibit-implied-resize t
  ;;      frame-resize-pixelwise t)
  
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)
  
  (setq fast-but-imprecise-scrolling t)
  (setq redisplay-skip-fontification-on-input t)
  
  (use-package solaire-mode
    :ensure :demand
    :hook (after-load-theme . solaire-global-mode))
  
  ;; preview theme: https://emacsthemes.com/
  (use-package doom-themes
    :ensure :demand
    :custom-face
    (doom-modeline-buffer-file ((t (:inherit (mode-line bold)))))
    :custom
    (doom-themes-enable-bold t)
    (doom-themes-enable-italic t)
    (doom-themes-treemacs-theme "doom-colors")
    :config
    (load-theme 'doom-gruvbox t)
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    (doom-themes-treemacs-config)
    (doom-themes-org-config))
  
  (use-package doom-modeline
    :ensure :demand
    :custom
    ;; 不显示换行和编码，节省空间
    (doom-modeline-buffer-encoding nil)
    ;; 显示语言版本（go、python 等）
    (doom-modeline-env-version t)
    ;; 分支名称长度
    (doom-modeline-vcs-max-length 20)
    (doom-modeline-github nil)
    :init
    (doom-modeline-mode 1))
  
  (use-package diredfl :ensure :demand :config (diredfl-global-mode))
  
  (use-package dashboard
    :ensure :demand
    :config
    (setq dashboard-banner-logo-title ";; Happy hacking, Zhang Jun - Emacs ♥ you!")
    (setq dashboard-center-content t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-navigator t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-items '((recents  . 5)
                            (projects . 5)
                            (bookmarks . 3)
                            (agenda . 3)))
    (dashboard-setup-startup-hook))
  
  ;; 字体
  ;; 中文：Sarasa Gothic: https://github.com/be5invis/Sarasa-Gothic
  ;; 英文：Iosevka SS14(Monospace, JetBrains Mono Style): https://github.com/be5invis/Iosevka/releases
  (use-package cnfonts
    :ensure :demand
    :init
    (setq cnfonts-personal-fontnames
          '(("Iosevka SS14" "Fira Code")
            ("Sarasa Gothic SC" "Source Han Mono SC")
            ("HanaMinB")))
    :config
    (setq cnfonts-use-face-font-rescale t)
    (cnfonts-enable))
  
  ;; 使用字体缓存，避免卡顿
  (setq inhibit-compacting-font-caches t)
  
  ;; 更新字体：M-x fira-code-mode-install-fonts
  (use-package fira-code-mode
    :ensure :demand
    :custom
    (fira-code-mode-disabled-ligatures '("[]" "#{" "#(" "#_" "#_(" "x"))
    :hook prog-mode)
  
  (use-package emojify
    :ensure :demand
    :hook (erc-mode . emojify-mode)
    :commands emojify-mode)
  
  ;; Emoji 字体
  (set-fontset-font "fontset-default" 'unicode "Apple Color Emoji" nil 'prepend)
  
  ;; 更新字体：M-x all-the-icons-install-fonts
  (use-package all-the-icons :ensure)
  
  (use-package ns-auto-titlebar
    :ensure :demand
    :config
    (when (eq system-type 'darwin) (ns-auto-titlebar-mode)))
  
  ;; 显示光标位置
  (use-package beacon :ensure :config (beacon-mode 1))
#+end_src

* 终端
** vterm

#+begin_src emacs-lisp
  ;;(shell-command "which cmake &>/dev/null || brew install cmake")
  ;;(shell-command "which glibtool &>/dev/null || brew install libtool")
  (use-package vterm
    :ensure :demand
    :config
    (setq vterm-max-scrollback 100000)
    ;; vterm buffer 名称，需要配置 shell 来支持（如 bash 的 PROMPT_COMMAND。）。
    (setq vterm-buffer-name-string "vterm %s")
    :bind
    (:map vterm-mode-map ("C-l" . nil))
    ;; 防止输入法切换冲突。
    (:map vterm-mode-map ("C-\\" . nil)) )
  
  (use-package multi-vterm
    :ensure :after (vterm)
    :config
    (define-key vterm-mode-map (kbd "M-RET") 'multi-vterm))
  
  (use-package vterm-toggle
    :ensure :after (vterm)
    :custom
    ;; project scope 表示整个 project 的 buffers 都使用同一个 vterm buffer。
    (vterm-toggle-scope 'project)
    :config
    (global-set-key (kbd "C-`") 'vterm-toggle)
    (global-set-key (kbd "C-~") 'vterm-toggle-cd)
    (define-key vterm-mode-map (kbd "C-RET") #'vterm-toggle-insert-cd)
    ;; 避免执行 ns-print-buffer 命令
    (global-unset-key (kbd "s-p"))
    (define-key vterm-mode-map (kbd "s-n") 'vterm-toggle-forward)
    (define-key vterm-mode-map (kbd "s-p") 'vterm-toggle-backward)
    ;; 在 frame 底部显示终端窗口，https://github.com/jixiuf/vterm-toggle。
    (setq vterm-toggle-fullscreen-p nil)
    (add-to-list
     'display-buffer-alist
     '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
       (display-buffer-reuse-window display-buffer-in-direction)
       (direction . bottom)
       (dedicated . t)
       (reusable-frames . visible)
       (window-height . 0.3))))
#+end_src
+ vterm-toggle 如果报错 "tcsetattr: Interrupted system call"，则解决办法[[https://github.com/jixiuf/vterm-toggle/pull/28][参考]],
  sleep 时间可能需要增加，直到不再报错即可。

除了 emacs 的配置外，需要在本地或远程 shell 也做配置，这样才能实现目录和命令提示
符追踪，[[https://github.com/akermu/emacs-libvterm/tree/master/etc][bash、zsh 的配置可以参考 vterm 的 github 文件]]。

对于 bash：
#+begin_src shell :results none
  if [[ "$TERM" = 'tramp' ]]; then
      PS1="[\u@\h \W]\$"
  fi
  
  if [[ "$INSIDE_EMACS" = 'vterm' ]]; then
      vterm_printf(){
          if [ -n "$TMUX" ] && ([ "${TERM%%-*}" = "tmux" ] || [ "${TERM%%-*}" = "screen" ] ); then
              # Tell tmux to pass the escape sequences through
              printf "\ePtmux;\e\e]%s\007\e\\" "$1"
          elif [ "${TERM%%-*}" = "screen" ]; then
              # GNU screen (screen, screen-256color, screen-256color-bce)
              printf "\eP\e]%s\007\e\\" "$1"
          else
              printf "\e]%s\e\\" "$1"
          fi
      }
  
      # vterm-clear-scrollback
      function clear(){
          vterm_printf "51;Evterm-clear-scrollback";
          tput clear;
      }
  
      # vterm-buffer-name-string
      PROMPT_COMMAND='echo -ne "\033]0;${HOSTNAME}:${PWD}\007"'
  
      # Directory tracking and Prompt tracking
      vterm_prompt_end(){
          vterm_printf "51;A$(whoami)@$(hostname):$(pwd)"
      }
      PS1=$PS1'\[$(vterm_prompt_end)\]'  
  fi
#+end_src
+ 重置 PS1 为标准的 unix 提示符，防止 tramp 判断失败；
+ ~$(hostname)~ 和 =${HOSTNAME}= 返回的必须是 PS1 显示的主机名，否则[[https://github.com/akermu/emacs-libvterm/issues/369][可能匹配失败]]，这
  时可以可以手动主机名；

对于 zsh：
#+begin_src shell :results none
if [[ "$TERM" = 'tramp' ]]; then
    PS1="[\u@\h \W]\$"
fi

if [[ "$INSIDE_EMACS" = 'vterm' ]]; then
     vterm_printf(){
         if [ -n "$TMUX" ] && ([ "${TERM%%-*}" = "tmux" ] || [ "${TERM%%-*}" = "screen" ] ); then
             # Tell tmux to pass the escape sequences through
             printf "\ePtmux;\e\e]%s\007\e\\" "$1"
         elif [ "${TERM%%-*}" = "screen" ]; then
             # GNU screen (screen, screen-256color, screen-256color-bce)
             printf "\eP\e]%s\007\e\\" "$1"
         else
             printf "\e]%s\e\\" "$1"
         fi
     }

    # vterm-clear-scrollback
    alias clear='vterm_printf "51;Evterm-clear-scrollback";tput clear'

    #vterm-buffer-name-string
    autoload -U add-zsh-hook
    add-zsh-hook -Uz chpwd (){ print -Pn "\e]2;%m:%2~\a" }
    
    # Directory tracking and Prompt tracking
    vterm_prompt_end() {
        vterm_printf "51;A$(whoami)@$(hostname):$(pwd)";
    }
    setopt PROMPT_SUBST
    PROMPT=$PROMPT'%{$(vterm_prompt_end)%}'
fi
#+end_src

