dotemacs.org
** eshell

#+begin_src emacs-lisp
  (setq explicit-shell-file-name "/bin/bash")
  (setq shell-file-name "bash")
  (setq shell-command-prompt-show-cwd t)
  (setq explicit-bash.exe-args '("--noediting" "--login" "-i"))
  (setenv "SHELL" shell-file-name)
  (add-hook 'comint-output-filter-functions 'comint-strip-ctrl-m)
  ;;(global-set-key [f1] 'shell)
  
  (use-package eshell-toggle
    :ensure :demand
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil)
    (eshell-toggle-init-function #'eshell-toggle-init-ansi-term)
    :bind
    ("s-`" . eshell-toggle))
  
  (use-package native-complete
    :ensure :demand
    :custom
    (with-eval-after-load 'shell
      (native-complete-setup-bash)))
  
  (use-package company-native-complete
    :ensure :demand :after (company)
    :custom
    (add-to-list 'company-backends 'company-native-complete))
  
  ;;; --- Cominit 模式
  (setq comint-prompt-read-only t)        ;;提示符只读
  
  ;;; --- Shell 模式
  (setq shell-command-completion-mode t)     ;;开启命令补全模式
  
  ;; eshell 高亮模式
  (autoload 'ansi-color-for-comint-mode-on "ansi-color" nil t)
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on t)
#+end_src

** tramp

#+begin_src emacs-lisp
  (setq  tramp-ssh-controlmaster-options
         "-o ControlMaster=auto -o ControlPath='tramp.%%C' -o ControlPersist=600 -o ServerAliveCountMax=60 -o ServerAliveInterval=10"
         vc-ignore-dir-regexp (format "\\(%s\\)\\|\\(%s\\)" vc-ignore-dir-regexp tramp-file-name-regexp)
         ;; 远程文件名不过期
         ;;remote-file-name-inhibit-cache nil
         ;;tramp-completion-reread-directory-timeout nil
         ;;tramp-verbose 1
         ;; 增加压缩传输的文件起始大小（默认 4KB），否则容易出错： “gzip: (stdin): unexpected end of file”
         tramp-inline-compress-start-size (* 1024 1024 1)
         tramp-copy-size-limit nil
         tramp-default-method "ssh"
         tramp-default-user "root"
         ;; 在登录远程终端时设置 TERM 环境变量为 tramp，这样可以在远程 shell 的初
         ;; 始化文件中对 tramp 登录情况做特殊处理，如设置 zsh 的 PS1。
         tramp-terminal-type "tramp"
         tramp-completion-reread-directory-timeout t)
#+end_src
+ 配置 tramp-terminal-type 为 "tramp"，这时远程 shell 中 $TERM 值为 tramp。如果
  是通过 vterm 登录远程 shell，则远程 shell 中 $INSIDE_EMACS 值为 vterm。（如果
  通过 emacs shell 登录远程 shell，则远程 shell 中 $INSIDE_EMACS 值为
  ‘version,comint’。
+ tramp 通过 ~shell-prompt-pattern~ 和 ~tramp-shell-prompt-pattern~ 来匹配远程 shell，
  如果匹配不上可能会一直 hang，这时可以在远程 shell 的启动文件中根据上面变量来重
  新定义 PS1。

#+begin_src shell :results none
if [[ "$TERM" = 'tramp' ]]; then
    PS1="[\u@\h \W]\$"
fi
#+end_src

