dotemacs.org
* 其它
#+begin_src emacs-lisp
    (setq
     ;; bookmark 发生变化时自动保存（默认是 Emacs 正常退出时保存）
     bookmark-save-flag 1
     ;; pdf 转为 png 时使用更高分辨率（默认 90）
     doc-view-resolution 144
     ;; 关闭烦人的出错时的提示声
     ring-bell-function 'ignore
     byte-compile-warnings '(cl-functions)
     confirm-kill-emacs #'y-or-n-p
     ad-redefinition-action 'accept
     vc-follow-symlinks t
     large-file-warning-threshold nil
     ;; 自动根据 window 大小显示图片
     image-transform-resize t
     grep-highlight-matches t
     ns-pop-up-frames nil)
    
    (setq-default  
     line-spacing 1
     ;; fill-column 的值应该小于 visual-fill-column-width，
     ;; 否则居中显示时行内容会过长而被隐藏；
     fill-column 80
     comment-fill-column 0
     recentf-max-menu-items 100
     recentf-max-saved-items 100
     recentf-exclude `("/tmp/" "/ssh:" ,(concat package-user-dir "/.*-autoloads\\.el\\'"))
     tab-width 4
     indent-tabs-mode nil
     debug-on-error nil
     message-log-max t
     load-prefer-newer t
     ad-redefinition-action 'accept)
    
    (recentf-mode +1)
    (fset 'yes-or-no-p 'y-or-n-p)
    (auto-image-file-mode t)
    (winner-mode t)
    
    ;; Mac 的 Command 键当做 meta 使用
    (setq mac-option-key-is-meta nil
          mac-command-key-is-meta t
          mac-command-modifier 'meta
          mac-option-modifier 'none)
    
    ;; Garbage Collector Magic Hack
    (setq gc-cons-threshold most-positive-fixnum)
    (defvar hidden-minor-modes '(whitespace-mode))
    (use-package gcmh
      :demand
      :init
      (setq gcmh-idle-delay 5
            gcmh-high-cons-threshold #x1000000) ; 16MB
      (gcmh-mode))
    
    ;; Mouse & Smooth Scroll
    ;; Scroll one line at a time (less "jumpy" than defaults)
    (when (display-graphic-p)
      (setq mouse-wheel-scroll-amount '(1 ((shift) . hscroll))
            mouse-wheel-scroll-amount-horizontal 1
            mouse-wheel-progressive-speed nil))
    (setq scroll-step 1
          scroll-margin 0
          scroll-conservatively 100000
          auto-window-vscroll nil
          scroll-preserve-screen-position t)
    
    (unless window-system
      (xterm-mouse-mode t)
      (global-set-key [mouse-4] (lambda () (interactive) (scroll-down 1)))
      (global-set-key [mouse-5] (lambda () (interactive) (scroll-up 1)))
      (setq 
       use-file-dialog nil
       use-dialog-box nil
       next-screen-context-lines 5
       ;; Emacs 和外部程序的粘贴
       x-select-enable-clipboard t
       select-enable-primary t
       select-enable-clipboard t
       ;; 粘贴于光标处,而不是鼠标指针处
       mouse-yank-at-point t))
    
    (global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
    (global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
    (global-set-key (kbd "S-C-<down>") 'shrink-window)
    (global-set-key (kbd "S-C-<up>") 'enlarge-window)
    
    ;;(shell-command "mkdir -p ~/.emacs.d/backup")
    (defvar backup-dir (expand-file-name "~/.emacs.d/backup/"))
    (setq backup-by-copying t
          backup-directory-alist (list (cons ".*" backup-dir))
          delete-old-versions t
          kept-new-versions 6
          kept-old-versions 2
          version-control t)
    
    ;;(shell-command "mkdir -p ~/.emacs.d/autosave")
    (defvar autosave-dir (expand-file-name "~/.emacs.d/autosave/"))
    (setq auto-save-list-file-prefix autosave-dir
          auto-save-file-name-transforms `((".*" ,autosave-dir t)))
    
    (global-set-key (kbd "C-x C-b") 'ibuffer)
    (setq dired-recursive-deletes t
          dired-recursive-copies t)
    (put 'dired-find-alternate-file 'disabled nil)
    
    (prefer-coding-system 'utf-8)
    (setq locale-coding-system 'utf-8
          default-buffer-file-coding-system 'utf-8)
    (set-buffer-file-coding-system 'utf-8)
    (set-language-environment "UTF-8")
    (set-default buffer-file-coding-system 'utf8)
    (set-default-coding-systems 'utf-8)
    (setenv "LANG" "zh_CN.UTF-8")
    (setenv "LC_ALL" "zh_CN.UTF-8")
    (setenv "LC_CTYPE" "zh_CN.UTF-8")
    
    ;;(setq browse-url-browser-function 'xwidget-webkit-browse-url)
    ;; (defvar xwidget-webkit-bookmark-jump-new-session)
    ;; (defvar xwidget-webkit-last-session-buffer)
    ;; (add-hook 'pre-command-hook
    ;;           (lambda ()
    ;;             (if (eq this-command #'bookmark-bmenu-list)
    ;;                 (if (not (eq major-mode 'xwidget-webkit-mode))
    ;;                     (setq xwidget-webkit-bookmark-jump-new-session t)
    ;;                   (setq xwidget-webkit-bookmark-jump-new-session nil)
    ;;                   (setq xwidget-webkit-last-session-buffer (current-buffer))))))
    
    ;;(shell-command "trash -v || brew install trash")
    (use-package osx-trash
      :config
      (when (eq system-type 'darwin)
        (osx-trash-setup))
      (setq delete-by-moving-to-trash t))
    
    ;; which-key 会导致 ediff 的 gX 命令 hang，解决办法是向 Emacs 发送 USR2 信号
    (use-package which-key
      :demand
      :init (which-key-mode)
      :diminish which-key-mode
      :config
      (setq which-key-idle-delay 1.1))
    
    ;; Emacs startup profiler
    (use-package esup)
    
    (use-package pomidor
      :bind ("<f12>" . pomidor)
      :config
      (setq pomidor-sound-tick nil
            pomidor-sound-tack nil)
      :init
      (setq alert-default-style 'mode-line)
      (setq pomidor-seconds (* 25 60)) ; 25 minutes for the work period
      (setq pomidor-break-seconds (* 5 60)) ; 5 minutes break time
      (setq pomidor-breaks-before-long 4) ; wait 4 short breaks before long break
      (setq pomidor-long-break-seconds (* 20 60)) ; 20 minutes long break time
      (with-eval-after-load 'all-the-icons
        (setq alert-severity-faces
              '((urgent   . all-the-icons-red)
                (high     . all-the-icons-orange)
                (moderate . all-the-icons-yellow)
                (normal   . all-the-icons-green)
                (low      . all-the-icons-blue)
                (trivial  . all-the-icons-purple))
              alert-severity-colors
              `((urgent   . ,(face-foreground 'all-the-icons-red))
                (high     . ,(face-foreground 'all-the-icons-orange))
                (moderate . ,(face-foreground 'all-the-icons-yellow))
                (normal   . ,(face-foreground 'all-the-icons-green))
                (low      . ,(face-foreground 'all-the-icons-blue))
                (trivial  . ,(face-foreground 'all-the-icons-purple)))))
      
      (when sys/macp
        (setq pomidor-play-sound-file
              (lambda (file)
                (when (executable-find "afplay")
                  (start-process "pomidor-play-sound" nil "afplay" file))))))
    
    ;; REST
    (use-package restclient
      :mode ("\\.http\\'" . restclient-mode)
      :config
      (use-package restclient-test
        :diminish
        :hook (restclient-mode . restclient-test-mode))
    
      (with-eval-after-load 'company
        (use-package company-restclient
          :defines company-backends
          :init (add-to-list 'company-backends 'company-restclient))))
  
    (server-start)
#+end_src
